import { Container, VStack, Box, Heading, Grid, GridItem } from '@chakra-ui/react'

export default function Chopai() {
    return(
        <Container>
            <VStack>
                <Heading>चौपाई</Heading>
                <Grid templateColumns='repeat(2, 1fr)' gap={10}>
                    <GridItem w='100%' h='100%'>
                        <Box>जय हनुमान ज्ञान गुन सागर</Box>
                        <Box>जय कपीस तिहुँ लोक उजागर॥१॥</Box>
                        <br/>
                        <Box>राम दूत अतुलित बल धामा</Box>
                        <Box>अंजनि पुत्र पवनसुत नामा॥२॥</Box>
                        <br/>
                        <Box>महाबीर बिक्रम बजरंगी</Box>
                        <Box>कुमति निवार सुमति के संगी॥३॥</Box>
                        <br/>
                        <Box>कंचन बरन बिराज सुबेसा</Box>
                        <Box>कानन कुंडल कुँचित केसा॥४॥</Box>
                        <br/>
                        <Box>हाथ बज्र अरु ध्वजा बिराजे</Box>
                        <Box>काँधे मूँज जनेऊ साजे॥५॥</Box>
                        <br/>
                        <Box>शंकर सुवन केसरी नंदन</Box>
                        <Box>तेज प्रताप महा जगवंदन॥६॥</Box>
                        <br/>
                        <Box>विद्यावान गुनी अति चातुर</Box>
                        <Box>राम काज करिबे को आतुर॥७॥</Box>
                        <br/>
                        <Box>प्रभु चरित्र सुनिबे को रसिया</Box>
                        <Box>राम लखन सीता मनबसिया॥८॥</Box>
                        <br/>
                        <Box>सूक्ष्म रूप धरि सियहि दिखावा</Box>
                        <Box>विकट रूप धरि लंक जरावा॥९॥</Box>
                        <br/>
                        <Box>भीम रूप धरि असुर सँहारे</Box>
                        <Box>रामचंद्र के काज सवाँरे॥१०॥</Box>
                        <br/>
                        <Box>लाय सजीवन लखन जियाए</Box>
                        <Box>श्री रघुबीर हरषि उर लाए॥११॥</Box>
                        <br/>
                        <Box>रघुपति कीन्ही बहुत बड़ाई</Box>
                        <Box>तुम मम प्रिय भरत-हि सम भाई॥१२॥</Box>
                        <br/>
                        <Box>सहस बदन तुम्हरो जस गावै</Box>
                        <Box>अस कहि श्रीपति कंठ लगावै॥१३॥</Box>
                        <br/>
                        <Box>सनकादिक ब्रह्मादि मुनीसा</Box>
                        <Box>नारद सारद सहित अहीसा॥१४॥</Box>
                        <br/>
                        <Box>जम कुबेर दिगपाल जहाँ ते</Box>
                        <Box>कवि कोविद कहि सके कहाँ ते॥१५॥</Box>
                        <br/>
                        <Box>तुम उपकार सुग्रीवहि कीन्हा</Box>
                        <Box>राम मिलाय राज पद दीन्हा॥१६॥</Box>
                        <br/>
                        <Box>तुम्हरो मंत्र बिभीषण माना</Box>
                        <Box>लंकेश्वर भये सब जग जाना॥१७॥</Box>
                        <br/>
                        <Box>जुग सहस्त्र जोजन पर भानू</Box>
                        <Box>लिल्यो ताहि मधुर फ़ल जानू॥१८॥</Box>
                        <br/>
                        <Box>प्रभु मुद्रिका मेलि मुख माही</Box>
                        <Box>जलधि लाँघि गए अचरज नाही॥१९॥</Box>
                        <br/>
                        <Box>दुर्गम काज जगत के जेते</Box>
                        <Box>सुगम अनुग्रह तुम्हरे तेते॥२०॥</Box>
                        <br/>
                    </GridItem>
                    <GridItem w='100%' h='100%'>
                        <Box>राम दुआरे तुम रखवारे</Box>
                        <Box>होत ना आज्ञा बिनु पैसारे॥२१॥</Box>
                        <br/>
                        <Box>सब सुख लहैं तुम्हारी सरना</Box>
                        <Box>तुम रक्षक काहु को डरना॥२२॥</Box>
                        <br/>
                        <Box>आपन तेज सम्हारो आपै</Box>
                        <Box>तीनों लोक हाँक तै कापै॥२३॥</Box>
                        <br/>
                        <Box>भूत पिशाच निकट नहि आवै</Box>
                        <Box>महावीर जब नाम सुनावै॥२४॥</Box>
                        <br/>
                        <Box>नासै रोग हरे सब पीरा</Box>
                        <Box>जपत निरंतर हनुमत बीरा॥२५॥</Box>
                        <br/>
                        <Box>संकट तै हनुमान छुडावै</Box>
                        <Box>मन क्रम वचन ध्यान जो लावै॥२६॥</Box>
                        <br/>
                        <Box>सब पर राम तपस्वी राजा</Box>
                        <Box>तिनके काज सकल तुम साजा॥२७॥</Box>
                        <br/>
                        <Box>और मनोरथ जो कोई लावै</Box>
                        <Box>सोई अमित जीवन फल पावै॥२८॥</Box>
                        <br/>
                        <Box>चारों जुग परताप तुम्हारा</Box>
                        <Box>है परसिद्ध जगत उजियारा॥२९॥</Box>
                        <br/>
                        <Box>साधु संत के तुम रखवारे</Box>
                        <Box>असुर निकंदन राम दुलारे॥३०॥</Box>
                        <br/>
                        <Box>अष्ट सिद्धि नौ निधि के दाता</Box>
                        <Box>अस बर दीन जानकी माता॥३१॥</Box>
                        <br/>
                        <Box>राम रसायन तुम्हरे पासा</Box>
                        <Box>सदा रहो रघुपति के दासा॥३२॥</Box>
                        <br/>
                        <Box>तुम्हरे भजन राम को पावै</Box>
                        <Box>जनम जनम के दुख बिसरावै॥३३॥</Box>
                        <br/>
                        <Box>अंतकाल रघुवरपुर जाई</Box>
                        <Box>जहाँ जन्म हरिभक्त कहाई॥३४॥</Box>
                        <br/>
                        <Box>और देवता चित्त ना धरई</Box>
                        <Box>हनुमत सेई सर्व सुख करई॥३५॥</Box>
                        <br/>
                        <Box>संकट कटै मिटै सब पीरा</Box>
                        <Box>जो सुमिरै हनुमत बलबीरा॥३६॥</Box>
                        <br/>
                        <Box>जै जै जै हनुमान गुसाईँ</Box>
                        <Box>कृपा करहु गुरु देव की नाई॥३७॥</Box>
                        <br/>
                        <Box>जो सत बार पाठ कर कोई</Box>
                        <Box>छूटहि बंदि महा सुख होई॥३८॥</Box>
                        <br/>
                        <Box>जो यह पढ़े हनुमान चालीसा</Box>
                        <Box>होय सिद्ध साखी गौरीसा॥३९॥</Box>
                        <br/>
                        <Box>तुलसीदास सदा हरि चेरा</Box>
                        <Box>कीजै नाथ हृदय मह डेरा॥४०॥</Box>
                        <br/>
                    </GridItem>
                </Grid>
            </VStack>
        </Container>
    );

}
